<?php

namespace App\Http\Controllers;

use App\Models\Post;

class PostController extends Controller
{

    /**
     * @return void
     */
    public function index() {
        $posts = Post::all();
        foreach ($posts as $post){
            echo '<h1>' . 'Title: ' . $post->title . '</h1>' . '<br>';
        }
    }

    /**
     * @return void
     */
    public function create() {
        $posts = [
            [
                'title' => 'Відпочинок на природі',
                'body' => 'Природа - це здоровя і корисно. Свіже повітря, приготування шашлику, риболовля, бадмінтон, купання в озерах і звичайні посиденьки, де можна розслабитися і просто насолодитися вихідними та вільним часом. Термін «відпочинок на природі» досить неоднозначне поняття, оскільки у кожного з нас є своє особливе уявлення про пікніки і виїзди за місто. Хтось насолоджується прогулянками в лісі, інші віддають перевагу пішим турам, багато хто просто насолоджується пікніками біля річки, та ночівлю в наметах. Однак, є й інша альтернатива, відпочинок в базах відпочинку, розташованих в самих барвистих регіонах нашої країни – а саме зелений туризм. Різновид внутрішнього туризму, який активно розвивається та з кожним роком набуває все більше і більше прихильників. Зелений сільський туризм, різновид відпочинку на природі, ось тільки звичні намети і ковдри замінять комфортабельні будиночки котеджного типу, альтанки з видом на Південний Буг і смачна, домашня українська кухня.',
                'image' => '/assets/upload/Relax_nature.jpg',
            ],            [
                'title' => 'Найкращі способи приготування їжі',
                'body' => 'Способів приготування їжі існує багато, втім, не всі вони є корисними для здоров’я. Спектр корисних і шкідливих властивостей страв, які ми отримаємо в результаті приготування тим чи іншим способом, дуже відрізняється. Наприклад, смаження у фритюрі може провокувати серйозні проблеми зі здоров’ям у довготривалій перспективі, тоді як приготування на парі допомагає більшості овочів зберегти максимум поживних речовин. Є й менш очевидні результати — наприклад, один метод приготування може підвищити поживний вміст одних продуктів, але суттєво знизити поживність інших.',
                'image' => '/assets/upload/Eat.jpg',
            ],
            [
                'title' => 'Велоспорт фізичної активності',
                'body' => 'Велоспорт – вид фізичної активності, який полягає в переміщенні на велосипеді за допомогою руху мязової сили людини. Також велосипедний спорт є однією з частин тріатлону. Головною організацією, яка контролює цей вид спорту, є Міжнародний союз велосипедистів. Він базується у Швейцарії. Велоспорт також є одним з видів активного відпочинку.',
                'image' => '/assets/upload/Bike.jpg',
            ],
            [
                'title' => 'Тренажерний зал 3 поради для новачків',
                'body' => 'Ви вирішили спробувати сходити до тренажерного залу чи після занять почуваєтеся не так, як очікували? Вивчіть цю добірку. Наші поради підкажуть, з чого почати і допоможуть виправити можливі помилки. Перший. Ваш рівень у фітнесі – новачок? Перед початком тренувань найкраще відвідати хоча б трьох лікарів: кардіолога, невропатолога та ендокринолога. Другий. Не забувайте про безпеку: перевірте тренажери перед використанням. Якщо ви не впевнені, що і як працює, попросіть тренера: у залі завжди має бути черговий. Третій. Дуже важливий принцип – поступовість. Не женіться за швидкими результатами і не кидайтеся з місця в карєр, намагаючись відразу вийти на високе навантаження.',
                'image' => '/assets/upload/trenirovka.jpg',
            ],
            [
                'title' => 'Корисне читання літератури',
                'body' => 'Коли мова заходить про читання, здоров’я людини та її хороше самопочуття, на думку в першу чергу спадають книги для саморозвитку, самотренінги та література, котра розповідає, як впоратися з тією чи іншою життєвою ситуацією. Проте, вчені (і не лише британські) доводять, що не важливо, які саме книги ви читаєте. Насправді читання художньої літератури – це прекрасний спосіб підтримувати і покращувати свій психологічний стан і здоров’я. Звісно, вони зовсім не рекомендують лікувати хронічну депресію «Голодними іграми» чи «Гаррі Поттером». З хронічними депресіями, роздратуваннями чи суїцидальними настроями все ж варто звернутися до фахівців. Ну а якщо у вас не виникає бажання накинутися на співрозмовника та не переслідує відчуття, що весь світ підглядає за вами, і ви просто бажаєте тримати себе в тонусі й в цілому дбати про власне самопочуття, тоді декілька розділів цікавої, захоплюючої книги перед сном – саме те, що вам потрібно! Доведено, що ті, хто читають книги, частіше і довше зберігають гостроту та ясність думки. І це стосується не лише тих, хто читає «розумну» літературу чи нон-фікшн.',
                'image' => '/assets/upload/reading.jpg',
            ],
            [
                'title' => 'Робота в офісі',
                'body' => 'Робота в затишному офісі – ось про що могли мріяти попередні покоління, коли праця здебільшого була фізичною та важкою. Тепло, затишно, спокійно та під силу практично в будь-якому віці. Однак з часом прийшло розуміння, що на зміну одним проблемам просто прийшли інші. Хто б міг подумати років двісті тому, що в ситому і комфортному суспільстві популярним стане використання сходів при наявності ліфту і використання мобільних додатків, що нагадують про необхідність змінити положення тіла. Та повернемося до офісної роботи. Окрім болю в спині чи очах від тривалого споглядання монітору, сучасні офісні працівники таки мають на що поскаржитися. Нещодавно експерти навіть змоделювати приблизний вигляд типового офісного працівника на основі врахування ряду проблем із здоров’ям, що виникають при тривалій роботі сидячи. Це вийшов вельми сумний манекен із згорбленою спиною, набряклими ногами та червоними очима.',
                'image' => '/assets/upload/workatoffice.jpg',
            ],
            [
                'title' => 'Список хобі та захоплень',
                'body' => 'Чим зайнятися у вільний час? Які є ідеї для хобі, як вибрати? Пропонуємо найбільший список хобі, захоплень та інтересів. Knitting - в’язання, Crochet - в’язання гачком, Cross stitch - вишивка хрестиком, Embroidery - вишивка, Quilt making - виготовлення ковдр, Decoupage - декупаж, Upcycling - рафтинг, Scrapbooking - скрапбукінг, Pencil drawing - малювання олівцем, Watercolour painting - малювання акварельними фарбами, Oil painting - малювання олійними фарбами, Adult colouring booking - дорослі розмальовки, Writing short stories - написання коротких історій, Reading novels - читання романів, Reading comics - читання коміксів, Drawing comics - малювання коміксів, Photography - фотографія, Graphic design - графічний дизайн, Photo manipulation (photoshop) - обробка фотографій, Silk screening - трафаретний друк, Lino cutting - вирізання з ліно, Calligraphy - каліграфія, Litter picking - збирання сміття, Volunteer work at an animal shelter - волонтерська робота у притулку для тварин, Cooking - приготування їжі, Baking - приготування випічки, Watching documentaries - перегляд документальних фільмів, Watching films - перегляд фільмів, Dog walking - прогулянки з собакою, Hockey - хокей, Baseball - баскетбол, Football - футбол, Rugby - регбі, Tennis - теніс, Badminton - бадмінтон, Table tennis - настільний теніс, Netball - нетбол.',
                'image' => '/assets/upload/Hobby.jpg',
            ],
            [
                'title' => 'Одяг як спосіб самовираження',
                'body' => 'Одяг відіграє у нашому житті дуже важливу роль. Протягом усієї багатовікової історії люди створювали одяг, в який вкладали частину своєї культури та самобутності. Тому одяг - це прояв матеріальної культури певної доби, традицій, а також особистісних якостей людини. На початковому етапі освоєння своєї спеціальності хотілося б детальніше вивчити значення костюма. І перш за все я хочу розглянути його із соціально-психологічного погляду, а точніше як одяг впливає на самооцінку, чим керується людина при виборі одягу і як справити правильне враження?',
                'image' => '/assets/upload/cloth.jpg',
            ],
            [
                'title' => 'Чим корисні подорожі для людини?',
                'body' => 'Чому люди так люблять подорожувати? Здавалося б, в епоху інформаційних технологій можна навіть не виходити з дому. Так, пам’ятки світу можна подивитися на екрані свого комп’ютера, а за допомогою сучасних технологій навіть відчути ефект присутності в якійсь країні. Але, тільки про ту людину, яка подорожує, можна сказати, що вона по-справжньому багата. Адже вона не просто відвідує різні країни і культури, а й змінює себе, трансформується, відкривається новому і пізнає світ. Навіщо потрібні подорожі? Більша частина нашого життя проходить за роботою, сімейними або побутовими справами. Озираючись назад, ми розуміємо, що багато часу витратили на те, щоб заробити гроші, отримати освіту, виростити дітей. І якщо не міняти обстановку і постійно перебувати в однотипній атмосфері, можна втратити себе і втратити інтерес до життя. Побачити красу світу і насолодитися відпочинком Коли людина стає туристом, вона починає пізнавати світ не з картинки телевізора, а через себе. Вона може спілкуватися з іншими народами, бачити їх культуру, пробувати їжу, слухати колоритні пісні і насолоджуватися пам’ятками. Це дозволяє легше зіставляти різні точки зору, ставати більш терпимою і доброзичливою. Подорожуючи людина поглинає культуру місцевості.',
                'image' => '/assets/upload/travel.jpg',
            ],
        ];

        foreach ($posts as $itemss){
            Post::create($itemss);
        }

        dd('create');
    }
}
