import React from 'react';
import MainFon from "../Comp/StyleComp/MainFon";

const About = () => {
    return (
        <div className="App">
            <MainFon
                title="Про нас"
                desc="Це сторінка, де ви можете дізнатися інформацію про мій проект."
            />
            <div className="container">
                <div className="about_content__block">
                    <h1>Дипломний проект</h1>
                    <p>Проект(веб-сайт) розроблений, щоб показати навички та не тільки, здобуті
                        у період навчання у колледжі.</p>
                    <h1>Мета створення веб-сайту</h1>
                    <p>Головною метою створення цього веб-сайту - є навчитися розробляти веб-сайти за допомогою
                    дуже широко росповсюджених технологій, що називается фреймворком.</p>
                    <h1>Тема веб-сайту Lifestyle</h1>
                    <p>Lifestyle - з перекладу це "стиль життя". Це запозичене словосполучення виступає центром цілої низки інновацій, наприклад: Lifestyle Office, Lifestyle Fitness. Так само використовується цей термін у індустрії медіа, журналістика про стиль життя (або лайфстайл-журналістика).</p>
                    <div style={{textAlign:"center", margin: "40px 0"}}>
                        <img width="700" src="/assets/images/Lifestyle.jpg"/>
                    </div>
                    <h1>За допомогою чого створений сайт</h1>
                    <p>Front-end частина веб-сайту було створено за допомогою одного з найвідоміших та розповсюджених фреймворків для мови
                    програмування JavaScript - ReactJS.</p>
                    <p>React — відкрита JavaScript бібліотека для створення інтерфейсів користувача,
                        яка покликана вирішувати проблеми часткового оновлення вмісту вебсторінки, з якими стикаються в
                        розробці односторінкових застосунків.
                        Розробляється Meta (раніше Facebook) і спільнотою індивідуальних розробників.</p>
                    <div style={{textAlign:"center", margin: "40px 0"}}>
                        <img width="400" src="/assets/images/React.png"/>
                    </div>
                    <p>Back-end частина веб-сайту розроблена на розповсюдженій на відомій мові програмуваня PHP, а саме його фреймворка Laravel.</p>
                    <p>Laravel — PHP-фреймворк призначений для розробки вебдодатків відповідно до шаблону model–view–controller (MVC). Серед особливостей Laravel можна назвати: модульну систему упакування з виділеним менеджером залежностей Composer; різні способи для доступу до реляційних баз даних; утиліти, які допомагають в розгортанні додатків і технічного обслуговування; орієнтація на синтаксичний цукор.</p>
                    <div style={{textAlign:"center", margin: "40px 0"}}>
                        <img width="300" src="/assets/images/Laravel.png"/>
                    </div>
                </div>
            </div>
        </div>
    );
};

export default About;
